{
  "intents": [
    {
      "tag": "saludo",
      "patterns": [
        "(.*) hola (.*)",
        "(.*) que tal (.*)",
        "(.*) buenos dias (.*)",
        "(.*) buenas tardes (.*)",
        "(.*) buenas noches (.*)"
      ],
      "responses": [
        "Hola, en que puedo asistirte",
        "¿Qué tal?, ¿En que puedo ayudarte?",
        "Como estas, En que puedo ayudarte",
        "Espero que te encuentres bien, En que puedo ayudarte"
      ]
    },
    {
      "tag": "estado",
      "patterns": [
        "(.*) como estas (.*)",
        "(.*) como te sientes (.*)",
        "(.*) como te encuentras (.*)",
        "(.*) que tal (.*)"
      ],
      "responses": [
        "Yo muy bien, espero que tu tambien",
        "Me encuentro maravillosamente, espero poder ayudarte",
        "Con todo el animo de ayudarte con lo que necesites sobre perros",
        "Con ganas de ayudar, espero que tu te encuentres muy bien"
      ]
    },
    {
      "tag": "nombre",
      "patterns": [
        "(.*) se llama (.*)",
        "(.*) nombre (.*)",
        "(.*) lo llame (.*)"
      ],
      "responses": [
        "Que lindo nombre tiene tu perro, dime en que te puedo ayudar",
        "Tiene nombre de buen chico, dime en que puedo ayudarte",
        "Gran nombre para un gran amigo, espero poder colaborarte"
      ]
    },
    {
      "tag": "razas",
      "patterns": ["(.*) razas (.*)", "(.*) razas caninas (.*)"],
      "responses": [
        "Las razas de perros son tan diversas como sus personalidades, desde las mas activas hasta las mas relajadas.",
        "Cada raza de perro tiene sus propias caracteristicas unicas, desde el tamano y el pelaje hasta la personalidad y la inteligencia.",
        "La diversidad de razas de perros permite encontrar el companero perfecto para cualquier estilo de vida y preferencia.",
        "Explorar las razas de perros es como sumergirse en un libro lleno de historias, cada raza tiene su propio capitulo unico."
      ]
    },
    {
      "tag": "comportamiento",
      "patterns": [
        "(.*) comportamiento  (.*)",
        "(.*) comportarse (.*)",
        "(.*) comportar (.*)"
      ],
      "responses": [
        "La lealtad y el amor incondicional son rasgos distintivos del comportamiento de los perros hacia sus duenos.",
        "La socializacion temprana es clave para desarrollar un comportamiento equilibrado y amigable en los perros.",
        "La empatia y la capacidad de entender las emociones humanas hacen que los perros sean companeros sensibles y comprensivos."
      ]
    },
    {
      "tag": "cuidados",
      "patterns": ["(.*) cuidar (.*)", "(.*) cuidados (.*)"],
      "responses": [
        "El cuidado responsable de un perro implica amor, compromiso y atencion diaria.",
        "La atencion a la salud mental de tu perro es tan importante como la fisica; observa sus senales de bienestar emocional.",
        "Las visitas regulares al veterinario son clave para la deteccion temprana de problemas de salud y para mantener las vacunas al dia."
      ]
    },
    {
      "tag": "vacunas",
      "patterns": ["(.*) vacunar (.*)", "(.*) vacunas (.*)"],
      "responses": [
        "El veterinario puede proporcionarte un calendario de vacunacion personalizado segun las necesidades especificas de tu mascota y su entorno.",
        "Algunas vacunas son obligatorias, mientras que otras son recomendadas segun el estilo de vida y riesgos de exposicion de tu perro.",
        "Las visitas regulares al veterinario son clave para la deteccion temprana de problemas de salud y para mantener las vacunas al dia.",
        "Consulta con tu veterinario si tienes preguntas o inquietudes sobre el programa de vacunación de tu perro; la prevencion es clave."
      ]
    },
    {
      "tag": "animo",
      "patterns": [
        "(.*) animo (.*)",
        "(.*) estado de animo (.*)",
        "(.*) estado emocional (.*)"
      ],
      "responses": [
        "Observa el lenguaje corporal de tu perro para comprender mejor su estado de animo y responder a sus necesidades emocionales.",
        "La atencion a la salud mental de tu perro es tan importante como la fisica; observa sus senales de bienestar emocional.",
        "Una rutina estable y cariño constante contribuyen a mantener un buen estado de animo en tu perro.",
        "Los perros son sensibles a cambios en su entorno; asegúrate de crear un ambiente seguro y tranquilo para promover un buen estado de ánimo."
      ]
    },
    {
      "tag": "jugar",
      "patterns": [
        "(.*) jugar (.*)",
        "(.*) entretener (.*)",
        "(.*) juego (.*)"
      ],
      "responses": [
        "Jugar es esencial para la salud mental y fisica de tu perro. Prueba con juguetes interactivos, paseos y juegos al aire libre."
      ]
    }
  ]
}
