{
  "intents": [
    {
      "tag": "saludo",
      "patterns": [
        "(.*) hola (.*)",
        "(.*) que tal (.*)",
        "(.*) buenos dias (.*)",
        "(.*) buenas tardes (.*)",
        "(.*) buenas noches (.*)",
        "(.*) como estas (.*)"
      ],
      "responses": [
        "Hola, en que puedo asistirte",
        "Que tal, En que puedo ayudarte",
        "Como estas, En que puedo ayudarte",
        "Espero que te encuentres bien, En que puedo ayudarte"
      ]
    },
    {
      "tag": "nombre",
      "patterns": [
        "(.*) se llama (.*)",
        "(.*) nombre (.*)",
        "(.*) lo llame (.*)"
      ],
      "responses": [
        "Que lindo nombre tiene tu perro, dime en que te puedo ayudar",
        "Tiene nombre de buen chico, dime en que puedo ayudarte",
        "Gran nombre para un gran amigo, espero poder colaborarte"
      ]
    },
    {
      "tag": "razas",
      "patterns": ["(.*) razas (.*)"],
      "responses": [
        "Las razas de perros son tan diversas como sus personalidades, desde las mas activas hasta las mas relajadas.",
        "Cada raza de perro tiene sus propias caracteristicas unicas, desde el tamano y el pelaje hasta la personalidad y la inteligencia.",
        "La diversidad de razas de perros permite encontrar el compañero perfecto para cualquier estilo de vida y preferencia.",
        "Explorar las razas de perros es como sumergirse en un libro lleno de historias, cada raza tiene su propio capitulo unico."
      ]
    },
    {
      "tag": "comportamiento",
      "patterns": [
        "(.*) comportamiento  (.*)",
        "(.*) comportarse (.*)",
        "(.*) comportar (.*)"
      ],
      "responses": [
        "La lealtad y el amor incondicional son rasgos distintivos del comportamiento de los perros hacia sus duenos.",
        "La socializacion temprana es clave para desarrollar un comportamiento equilibrado y amigable en los perros.",
        "La empatia y la capacidad de entender las emociones humanas hacen que los perros sean compañeros sensibles y comprensivos."
      ]
    },
    {
      "tag": "cuidados",
      "patterns": ["(.*) cuidar (.*)", "(.*) cuidados (.*)"],
      "responses": [
        "El cuidado responsable de un perro implica amor, compromiso y atencion diaria.",
        "La atencion a la salud mental de tu perro es tan importante como la fisica; observa sus senales de bienestar emocional.",
        "Las visitas regulares al veterinario son clave para la deteccion temprana de problemas de salud y para mantener las vacunas al dia."
      ]
    }
  ]
}
